aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_sdio.cpp
//-------------------------------------------------------------------------------------------------
//
//  File : lib_class_STM32H7_sdio.cpp
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2025 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------
//
// Notes:
//
//          SD_Detect-Pin
//          SDIO_D0  = SD-Card DAT0
//          SDIO_D1  = SD-Card DAT1
//          SDIO_D2  = SD-Card DAT2
//          SDIO_D3  = SD-Card DAT3/CD
//          SDIO_CK  = SD-Card Clock
//          SDIO_CMD = SD-Card CMD
//
//          DMA : either  DMA2_STREAM3_CHANNEL4
//                   or   DMA2_STREAM6_CHANNEL4
//
//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#define SDIO_DRIVER_GLOBAL
#include "./lib_digini.h"
#undef  SDIO_DRIVER_GLOBAL
#include "stm32H7xx_ll_sdmmc.h"   // to replace this with my stuff

//-------------------------------------------------------------------------------------------------

#if (USE_SDIO_DRIVER == DEF_ENABLED)

//-------------------------------------------------------------------------------------------------
// Define(s)
//-------------------------------------------------------------------------------------------------

#define SD_DATA_TIMEOUT                 ((uint32_t)0x00100000)
#define SD_SOFTWARE_COMMAND_TIMEOUT     ((uint32_t)0x00010000)

// stuff to change
#define SD_CARD_RETRY_TIMER             (1000 / SD_CARD_TICK_PERIOD)
#define SD_CARD_TICK_PERIOD             1


#define ClearAllFlag()                  { SDMMC1->ICR = (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_CTIMEOUT | \
                                                         SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_RXOVERR  | \
                                                         SDMMC_FLAG_CMDREND  | SDMMC_FLAG_CMDSENT  | SDMMC_FLAG_DATAEND  | \
                                                         SDMMC_FLAG_DBCKEND); }


#define ClearClockRegister()            { SDMMC1->CLKCR = ~((uint32_t)(SDMMC_CLKCR_CLKDIV  | SDMMC_CLKCR_PWRSAV |\
                                                                       SDMMC_CLKCR_BYPASS  | SDMMC_CLKCR_WIDBUS |\
                                                                       SDMMC_CLKCR_NEGEDGE | SDMMC_CLKCR_HWFC_EN)); }

//-------------------------------------------------------------------------------------------------
// Typedef(s)
//-------------------------------------------------------------------------------------------------

enum SD_CardState_t
{
    SD_CARD_READY                  = ((uint32_t)0x00000001),  // Card state is ready
    SD_CARD_IDENTIFICATION         = ((uint32_t)0x00000002),  // Card is in identification state
    SD_CARD_STANDBY                = ((uint32_t)0x00000003),  // Card is in standby state
    SD_CARD_TRANSFER               = ((uint32_t)0x00000004),  // Card is in transfer state
    SD_CARD_SENDING                = ((uint32_t)0x00000005),  // Card is sending an operation
    SD_CARD_RECEIVING              = ((uint32_t)0x00000006),  // Card is receiving operation information
    SD_CARD_PROGRAMMING            = ((uint32_t)0x00000007),  // Card is in programming state
    SD_CARD_DISCONNECTED           = ((uint32_t)0x00000008),  // Card is disconnected
    SD_CARD_ERROR                  = ((uint32_t)0x000000FF)   // Card is in error state
};

//-------------------------------------------------------------------------------------------------
//
//   Constructor:   SDIO_Driver
//
//   Parameter(s):  SDIO_Info_t* pInfo
//
//   Description:   Initializes the IO and the peripheral
//
//-------------------------------------------------------------------------------------------------
SDIO_Driver::SDIO_Driver(SDIO_Info_t* pInfo)
{
    m_pInfo = pInfo;
    m_IsItInitialize = false;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: Initialize
//
//   Parameter(s):  None
//
//   Description:   Initializes the IO and the peripheral
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::Initialize(void)
{
    if(m_IsItInitialize == false)
    {
        nOS_MutexCreate(&m_Mutex, NOS_MUTEX_RECURSIVE, NOS_MUTEX_PRIO_INHERIT);

        // Reset SDIO Module
        RCC->APB2RSTR |=  RCC_APB2RSTR_SDMMC1RST;
        RCC->APB2RSTR &= ~RCC_APB2RSTR_SDMMC1RST;

        // Enable SDIO clock
        RCC->APB2ENR |= RCC_APB2ENR_SDMMC1EN;

        /// ---- GPIOs Configuration ----
        for(uint32_t IO_Id = uint32_t(IO_SD_D0); IO_Id <= uint32_t(IO_SD_CMD); IO_Id++)
        {
            IO_PinInit(IO_ID_e(IO_Id));
        }

      #if SD_CARD_USE_DETECT_SIGNAL == 1
        IO_PinInit(IO_DETECT_SD_CARD);
      #endif

      #if SD_CARD_USE_POWER_CONTROL == 1
        IO_OutputInit(IO_POWER_SD_CARD);
      #endif

        // Initialize DMA2 channel 3 for RX from SD CARD
        m_DMA_RX.Initialize(&m_pInfo->DMA_RX);                                      // Write config that will never change
        m_DMA_RX.SetSource((void*)&SDMMC1->FIFO);
        m_DMA_RX.ClearFlag();
        m_DMA_RX.SetFifoControl(DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                   // Configuration FIFO control register


        // Initialize DMA2 channel 6 for TX to SD CARD
        m_DMA_TX.Initialize(&m_pInfo->DMA_TX);                                      // Write config that will never change
        m_DMA_TX.SetDestination((void*)&SDMMC1->FIFO);
        m_DMA_TX.ClearFlag();
        m_DMA_TX.SetFifoControl(DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                   // Configuration FIFO control register

        m_CardStatus       = STA_NOINIT;
        m_TransferError    = SYS_READY;
 //       m_DMA_XferComplete = false;
        m_TransferComplete = false;

        //m_SendStopTransfer = false;
        // m_TickPeriod   = SD_CARD_TICK_PERIOD;

        // NVIC configuration for SDIO interrupts
        ISR_Init(SDMMC1_IRQn, 5);

        // NVIC configuration for DMA transfer complete interrupt
        m_DMA_RX.EnableIRQ();
        m_DMA_TX.EnableIRQ();

        // Initialize SDMMC peripheral interface with default configuration for SD card initialization
        ClearClockRegister();
        SDMMC1->CLKCR |=  (uint32_t)SDMMC_INIT_CLK_DIV;

        m_IsItInitialize = true;
    }
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: GetStatus
//
//   Parameter(s):  uint32_t*       pResponse
//   Return value:  SystemState_e
//
//   Description:   Get response from SD device
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::GetStatus(void)
{
    SystemState_e  State;
    uint32_t       Response1;
    SD_CardState_t CardState;

    if((State = this->IsDetected()) == SYS_READY)
    {
        if((State = this->TransmitCommand((CMD13 | SD_SHORT_RESPONSE), m_RCA, 1)) == SYS_READY)
        {
            Response1 = SDMMC1->RESP1;
            CardState = (SD_CardState_t)((Response1 >> 9) & 0x0F);

            // Find SD status according to card state
            if     (CardState == SD_CARD_TRANSFER)  State = SYS_READY;
            else if(CardState == SD_CARD_ERROR)     State = SYS_DEVICE_ERROR;
            else                                    State = SYS_DEVICE_BUSY;
        }
        else
        {
            State = SYS_DEVICE_ERROR;
        }
    }

