aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_sdio.cpp
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: GetResponse
//
//   Parameter(s):  uint32_t*       pResponse
//   Return value:  SystemState_e
//
//   Description:   Get response from SD device
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::GetResponse(uint32_t* pResponse)
{
    pResponse[0] = SDMMC1->RESP1;
    pResponse[1] = SDMMC1->RESP2;
    pResponse[2] = SDMMC1->RESP3;
    pResponse[3] = SDMMC1->RESP4;

    return SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetBusWidth
//
//  Parameter(s):   uint32_t        WideMode
//  Return:         SystemState_e   State
//
//  Description:    Set the bus width of the SDMMC module
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::SetBusWidth(uint32_t WideMode)
{
    SystemState_e State;
    uint32_t      Temp;

    // MMC Card does not support this feature
    if(m_CardType == SD_MULTIMEDIA)
    {
        State = SYS_UNSUPPORTED_FEATURE;
    }
    else if((m_CardType == SD_STD_CAPACITY_V1_1) || (m_CardType == SD_STD_CAPACITY_V2_0) ||\
            (m_CardType == SD_HIGH_CAPACITY))
    {
        if(WideMode == SD_BUS_WIDE_8B)
        {
            State = SYS_UNSUPPORTED_FEATURE;
        }
        else if((WideMode == SD_BUS_WIDE_4B) ||
                (WideMode == SD_BUS_WIDE_1B))
        {
            if((SDMMC1->RESP1 & SD_CARD_LOCKED) != SD_CARD_LOCKED)
            {
                // Get SCR Register
                if((State = this->FindSCR()) == SYS_READY)
                {
                    Temp = (WideMode == SD_BUS_WIDE_4B) ? SD_WIDE_BUS_SUPPORT : SD_SINGLE_BUS_SUPPORT;

                    // If requested card supports wide bus operation
                    if((m_SCR.Array[0] & Temp) != 0)
                    {
                        // Send CMD55 APP_CMD with argument as card's RCA.
                        if((State = this->TransmitCommand((CMD55 | SD_SHORT_RESPONSE), m_RCA, 1)) == SYS_READY)
                        {
                            Temp = (WideMode == SD_BUS_WIDE_4B) ? 2 : 0;

                            // Send ACMD6 APP_CMD with argument as 2 for wide bus mode
                            State =  this->TransmitCommand((CMD6 | SD_SHORT_RESPONSE), Temp, 1);
                        }
                    }
                    else
                    {
                        State = SYS_REQUEST_NOT_APPLICABLE;
                    }
                }
            }
            else
            {
                State = SYS_LOCK_UNLOCK_FAILED;
            }
        }
        else
        {
            State = SYS_INVALID_PARAMETER;  // WideMode is not a valid argument
        }

        if(State == SYS_READY)
        {
            // Configure the SDMMC peripheral
            ClearClockRegister();
            SDMMC1->CLKCR |=  (uint32_t)WideMode;
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: TransmitCommand
//
//   Parameter(s):  uint8_t         Command
//                  uint32_t        Argument
//                  int32_t         ResponseType
//   Return value:  SystemState_e
//
//   Description:   Send command to the SD Card
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::TransmitCommand(uint8_t Command, uint32_t Argument, int32_t ResponseType)
{
    SystemState_e   State;

    ClearAllFlag();                                                     // Clear the Command Flags
    SDMMC1->ARG = (uint32_t)Argument;                                   // Set the SDMMC Argument value
    SDMMC1->CMD = (uint32_t)(Command | SDMMC_CMD_CPSMEN);               // Set SDMMC command parameters
    m_LastCommand = Command;

    if((Argument == 0) && (ResponseType == 0))
    {
        ResponseType = -1;       // Go idle command
    }

    State = this->CmdResponse(Command & SDMMC_CMD_CMDINDEX, ResponseType);
    ClearAllFlag();                                                     // Clear the Command Flags

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: CheckOCR_Response
//
//   Parameter(s):  uint32_t        Response_R1      OCR Response code
//   Return value:  SystemState_e
//
//   Description:   Analyze the OCR response and return the appropriate error code
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::CheckOCR_Response(uint32_t Response_R1)
{
    if((Response_R1 & SD_OCR_ERRORBITS)             == 0)                           return SYS_READY;
    if((Response_R1 & SD_OCR_ADDR_OUT_OF_RANGE)     == SD_OCR_ADDR_OUT_OF_RANGE)    return SYS_OUT_OF_RANGE;
    if((Response_R1 & SD_OCR_ADDR_MISALIGNED)       == SD_OCR_ADDR_MISALIGNED)      return SYS_ADDRESS_MISALIGNED;
    if((Response_R1 & SD_OCR_BLOCK_LEN_ERR)         == SD_OCR_BLOCK_LEN_ERR)        return SYS_BLOCK_LENGTH_ERROR;
    if((Response_R1 & SD_OCR_ERASE_SEQ_ERR)         == SD_OCR_ERASE_SEQ_ERR)        return SD_ERASE_SEQ_ERR;
    if((Response_R1 & SD_OCR_BAD_ERASE_PARAM)       == SD_OCR_BAD_ERASE_PARAM)      return SD_BAD_ERASE_PARAM;
    if((Response_R1 & SD_OCR_WRITE_PROT_VIOLATION)  == SD_OCR_WRITE_PROT_VIOLATION) return SD_WRITE_PROT_VIOLATION;
    if((Response_R1 & SD_OCR_LOCK_UNLOCK_FAILED)    == SD_OCR_LOCK_UNLOCK_FAILED)   return SYS_LOCK_UNLOCK_FAILED;
    if((Response_R1 & SD_OCR_COM_CRC_FAILED)        == SD_OCR_COM_CRC_FAILED)       return SYS_CRC_FAIL;
    if((Response_R1 & SD_OCR_ILLEGAL_CMD)           == SD_OCR_ILLEGAL_CMD)          return SYS_INVALID_COMMAND;
    if((Response_R1 & SD_OCR_CARD_ECC_FAILED)       == SD_OCR_CARD_ECC_FAILED)      return SD_CARD_ECC_FAILED;
    if((Response_R1 & SD_OCR_CC_ERROR)              == SD_OCR_CC_ERROR)             return SD_CC_ERROR;
    if((Response_R1 & SD_OCR_GENERAL_UNKNOWN_ERROR) == SD_OCR_GENERAL_UNKNOWN_ERROR)return SYS_GENERAL_UNKNOWN_ERROR;
    if((Response_R1 & SD_OCR_STREAM_READ_UNDERRUN)  == SD_OCR_STREAM_READ_UNDERRUN) return SYS_UNDERRUN;
    if((Response_R1 & SD_OCR_STREAM_WRITE_OVERRUN)  == SD_OCR_STREAM_WRITE_OVERRUN) return SYS_OVERRUN;
    if((Response_R1 & SD_OCR_CID_CSD_OVERWRITE)     == SD_OCR_CID_CSD_OVERWRITE)    return SD_CID_CSD_OVERWRITE;
    if((Response_R1 & SD_OCR_WP_ERASE_SKIP)         == SD_OCR_WP_ERASE_SKIP)        return SD_WP_ERASE_SKIP;
    if((Response_R1 & SD_OCR_CARD_ECC_DISABLED)     == SD_OCR_CARD_ECC_DISABLED)    return SD_CARD_ECC_DISABLED;
    if((Response_R1 & SD_OCR_ERASE_RESET)           == SD_OCR_ERASE_RESET)          return SD_ERASE_RESET;
    if((Response_R1 & SD_OCR_AKE_SEQ_ERROR)         == SD_OCR_AKE_SEQ_ERROR)        return SD_AKE_SEQ_ERROR;

