aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_sdio.cpp
    // Byte 4
    //m_CSD.CardComdClasses = uint16_t(uint8_t(m_CardCSD[1] >> 24)) << 4;           // Not useful information

    // Byte 5
    Temp = uint8_t(m_CardCSD[1] >> 16);
    //m_CSD.CardComdClasses |= uint16_t(Temp >> 4);         // not useful information
    m_CSD.RdBlockLen       = Temp & 0x0F;
  #endif

    // Byte 6
    Temp = uint8_t(m_CardCSD[1] >> 8);
  #if (SDIO_USE_MAXIMUM_INFORMATION == DEF_ENABLED)
    m_CSD.PartBlockRead   = Temp >> 7;
    m_CSD.WrBlockMisalign = (Temp & 0x40) >> 6;
    m_CSD.RdBlockMisalign = (Temp & 0x20) >> 5;
    m_CSD.DSRImpl         = (Temp & 0x10) >> 4;
  #endif

    if((m_CardType == SD_STD_CAPACITY_V1_1) || (m_CardType == SD_STD_CAPACITY_V2_0))
    {
        m_CSD.DeviceSize = uint32_t(uint8_t(Temp & 0x03)) << 10;

        // Byte 7
        m_CSD.DeviceSize |= uint32_t(uint8_t(m_CardCSD[1])) << 2;

        // Byte 8
        Temp = uint8_t(m_CardCSD[2] >> 24);
        m_CSD.DeviceSize |= uint32_t(Temp >> 6);

      #if (SDIO_USE_MAXIMUM_INFORMATION == DEF_ENABLED)
        //m_CSD.MaxRdCurrentVDDMin = (Temp & 0x38) >> 3;        // Not useful information
        //m_CSD.MaxRdCurrentVDDMax = Temp & 0x07;               // Not useful information
      #endif
        // Byte 9
        Temp = uint8_t(m_CardCSD[2] >> 16);
      #if (SDIO_USE_MAXIMUM_INFORMATION == DEF_ENABLED)
        //m_CSD.MaxWrCurrentVDDMin = Temp >> 5;                 // Not useful information
        //m_CSD.MaxWrCurrentVDDMax = (Temp & 0x1C) >> 2;        // Not useful information
      #endif
        m_CSD.DeviceSizeMul = (Temp & 0x03) << 1;

        // Byte 10
        m_CSD.DeviceSizeMul |= uint8_t(m_CardCSD[2] >> 8) >> 7;

        m_CardCapacity  = m_CSD.DeviceSize + 1;
        m_CardCapacity *= (1 << (m_CSD.DeviceSizeMul + 2));
        m_CardBlockSize = 1 << (m_CSD.RdBlockLen);
    }
    else if(m_CardType == SD_HIGH_CAPACITY)
    {
        // Byte 7
        m_CSD.DeviceSize = (uint32_t(uint8_t(m_CardCSD[1]) & 0x3F) << 16);

        // Byte 8
        m_CSD.DeviceSize |= (uint32_t(uint8_t(m_CardCSD[2] >> 24)) << 8);

        // Byte 9
        m_CSD.DeviceSize |= uint32_t(uint8_t(m_CardCSD[2] >> 16));

        m_CardCapacity  = (m_CSD.DeviceSize + 1) * BLOCK_SIZE;
        m_CardBlockSize = BLOCK_SIZE;
    }
    else
    {
        // Not supported card type
        State = SYS_ERROR;
    }

  #if (SDIO_USE_MAXIMUM_INFORMATION == DEF_ENABLED)

    // Byte 10
    Temp = uint8_t(m_CardCSD[2] >> 8);
    m_CSD.EraseGrSize = (Temp & 0x40) >> 6;
    m_CSD.EraseGrMul  = (Temp & 0x3F) << 1;

    // Byte 11
    Temp = uint8_t(m_CardCSD[2]);
    m_CSD.EraseGrMul     |= Temp >> 7;
    m_CSD.WrProtectGrSize = (Temp & 0x7F);

    // Byte 12
    Temp = uint8_t(m_CardCSD[3] >> 24);
    m_CSD.WrProtectGrEnable =  Temp >> 7;
    m_CSD.ManDeflECC        = (Temp & 0x60) >> 5;
    //m_CSD.WrSpeedFact       = (Temp & 0x1C) >> 2;         // Information not to be used as per standard
    m_CSD.MaxWrBlockLen     = (Temp & 0x03) << 2;

    // Byte 13
    Temp = uint8_t(m_CardCSD[3] >> 16);
    m_CSD.MaxWrBlockLen      |= (Temp >> 6);
    m_CSD.WriteBlockPaPartial = (Temp & 0x20) >> 5;
    m_CSD.ContentProtectAppli = (Temp & 0x01);

    // Byte 14
    Temp = uint8_t(m_CardCSD[3] >> 8);
    m_CSD.FileFormatGroup = Temp >> 7;
    m_CSD.CopyFlag        = (Temp & 0x40) >> 6;
    m_CSD.PermWrProtect   = (Temp & 0x20) >> 5;
    m_CSD.TempWrProtect   = (Temp & 0x10) >> 4;
    m_CSD.FileFormat      = (Temp & 0x0C) >> 2;
    m_CSD.ECC             = (Temp & 0x03);

    // Byte 15
    m_CSD._CRC = uint8_t(m_CardCSD[3]) >> 1;

    // CID Section

    m_CID.ManufacturerID      =          uint8_t(m_CardCID[0]   >> 24);                 // Byte 0
    m_CID.OEM_AppliID         = uint16_t(uint8_t(m_CardCID[0]   >> 16))        << 8;    // Byte 1
    m_CID.OEM_AppliID        |= uint16_t(uint8_t(m_CardCID[0]   >> 8));                 // Byte 2

    m_CID.ProductName[0]      = char(m_CardCID[0]);                                     // Byte 3
    m_CID.ProductName[1]      = char(m_CardCID[1] >> 24);                               // Byte 4
    m_CID.ProductName[2]      = char(m_CardCID[1] >> 16);                               // Byte 4
    m_CID.ProductName[3]      = char(m_CardCID[1] >> 8);                                // Byte 4
    m_CID.ProductName[4]      = char(m_CardCID[1]);                                     // Byte 4
    m_CID.ProductName[5]      = '\0';

    m_CID.ProductRev          =          uint8_t(m_CardCID[2]   >> 24);                  // Byte 8
    m_CID.ProductSN           = uint32_t(uint8_t(m_CardCID[2]   >> 16))        << 24;    // Byte 9
    m_CID.ProductSN          |= uint32_t(uint8_t(m_CardCID[2]   >> 8))         << 16;    // Byte 10
    m_CID.ProductSN          |= uint32_t(uint8_t(m_CardCID[2]))                << 8;     // Byte 11
    m_CID.ProductSN          |= uint32_t(uint8_t(m_CardCID[3]   >> 24));                 // Byte 12
    m_CID.ManufacturingDate   = uint16_t(uint8_t(m_CardCID[3]   >> 16) & 0x0F) << 8;     // Byte 13
    m_CID.ManufacturingDate  |= uint16_t(uint8_t(m_CardCID[3]   >> 8));                  // Byte 14
    m_CID._CRC                =          uint8_t(m_CardCID[3])  >> 1;                    // Byte 15
  #endif

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  ****  ****  * *   *   *  ***** *****
//  *   * *   * * *   *  * *   *   *
//  ****  ****  * *   * *   *  *   ****
//  *     *  *  *  * *  *****  *   *
//  *     *   * *   *   *   *  *   *****
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//
//   Function:      Lock
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   Lock the driver
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::Lock(void)
{
    while(nOS_MutexLock(&m_Mutex, NOS_WAIT_INFINITE) != NOS_OK) {};
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Unlock
//
//   Parameter(s):
//   Return Value:
//
//   Description:   Unlock the driver
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::Unlock(void)
{
    nOS_MutexUnlock(&m_Mutex);
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: StartBlockTransfert
//
//   Parameter(s):  DMA_Stream_TypeDef* pDMA            DMA Stream to use for the DMA operation
//                  uint64_t            pBuffer         Pointer to/for the buffer the data
//                  uint32_t            BlockSize       The SD card Data block size
//                  uint32_t            NumberOfBlocks  Number of blocks to access
//   Return value:  SystemState_e
//
//   Description:   Prepare the DMA transfer
//
//   note(s):       This should be preceding the functions WriteBlocks() or ReadBlocks()
//                  completion of the write process (by SD current status polling).
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::StartBlockTransfert(DMA_Stream_TypeDef* pDMA, uint32_t* pBuffer, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SDMMC1->DCTRL      = 0;                                                                 // Initialize data control register
    m_TransferComplete = false;                                                                 // Initialize handle flags
//    m_DMA_XferComplete = false;
    m_TransferError    = SYS_READY;
    m_Operation        = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;        // Initialize SD Read operation
    SDMMC1->MASK      |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE |                   // Enable transfer interrupts
                          SDMMC_MASK_DATAENDIE  | SDMMC_MASK_RXOVERRIE);
    SDMMC1->DCTRL     |= SDMMC_DCTRL_DMAEN;                                                 // Enable SDMMC DMA transfer
    pDMA->CR          &= ~DMA_SxCR_EN;                                                      // Disable the Peripheral
    pDMA->NDTR         = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                        // Configure DMA Stream data length
    pDMA->M0AR         = (uint32_t)pBuffer;                                                 // Configure DMA Stream memory address
    pDMA->CR          |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;    // Enable all interrupts
    pDMA->FCR         |= DMA_SxFCR_FEIE;
    pDMA->CR          |= DMA_SxCR_EN;                                                       // Enable the Peripheral
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: ReadBlocks
//
//   Parameter(s):  uint64_t ReadAddress
//                  uint32_t BlockSize
//                  uint32_t NumberOfBlocks
//   Return value:  SystemState_e
//
//   Description:   Reads block(s) from a specified address in a card. The Data transfer is managed
//                  by DMA mode.
//
//   note(s):       This API should be followed by the function CheckOperation() to check the
//                  completion of the write process (by SD current status polling).
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::ReadBlocks(uint64_t ReadAddress, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SystemState_e State;
    uint32_t      CmdIndex;

