aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_sdio.cpp
    if(m_CardType == SD_HIGH_CAPACITY)
    {
        BlockSize    = 512;
        ReadAddress /= 512;
    }

    // Set Block Size for Card
    if((State = this->TransmitCommand((CMD16 | SD_SHORT_RESPONSE), BlockSize, 1)) == SYS_READY)
    {
        // Configure the SD DPSM (Data Path State Machine)
        this->DataInit(BlockSize * NumberOfBlocks, SD_DATABLOCK_SIZE_512B, true);

    }

    // Send CMD18 READ_MULT_BLOCK with argument data address
    // or send CMD17 READ_SINGLE_BLOCK depending on number of block
    CmdIndex = (NumberOfBlocks > 1) ? CMD18 : CMD17;
    State    = this->TransmitCommand((CmdIndex | SD_SHORT_RESPONSE), (uint32_t)ReadAddress, 1);

    // Update the SD transfer error in SD handle
    m_TransferError = State;

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: WriteBlocks
//
//   Parameter(s):  uint64_t WriteAddress
//                  uint32_t BlockSize
//                  uint32_t NumberOfBlocks
//   Return value:  SystemState_e
//
//   Description:   Writes block(s) to a specified address in a card. The Data transfer is managed
//                  by DMA mode.
//
//   note(s):       This API should be followed by the function CheckOperation() to check the
//                  completion of the write process (by SD current status polling).
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::WriteBlocks(uint64_t WriteAddress, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SystemState_e State;
    uint32_t      CmdIndex;

    if(m_CardType == SD_HIGH_CAPACITY)
    {
        BlockSize    = 512;
        WriteAddress /= 512;
    }

    // Check number of blocks command
    // Send CMD24 WRITE_SINGLE_BLOCK
    // Send CMD25 WRITE_MULT_BLOCK with argument data address
    CmdIndex = (NumberOfBlocks > 1) ? CMD25 : CMD24;

    // Set Block Size for Card
    if((State = this->TransmitCommand((CmdIndex | SD_SHORT_RESPONSE), (uint32_t)WriteAddress, 1)) != SYS_READY)
    {
        return State;
    }

    // Configure the SD DPSM (Data Path State Machine)
    this->DataInit(BlockSize * NumberOfBlocks, SD_DATABLOCK_SIZE_512B, false);

    m_TransferError = State;

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: CheckOperation
//
//   Parameter(s):  uint32_t       Flag
//   Return value:  SystemState_e
//
//   Description:   This function waits until the SD DMA data wirte or read transfer is finished.
//                  This should be called after WriteBlocks_DMA or SD_ReadBlocks_DMA() function
//                  to insure that all data sent is already transferred by the DMA controller.
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::CheckOperation(uint32_t Flag)
{
    SystemState_e  State;
    uint32_t       TimeOut;

    // Wait for DMA/SD transfer end or SD error variables
    TimeOut = SD_DATA_TIMEOUT;
    while(/*(m_DMA_XferComplete == false)     &&*/
          (m_TransferComplete == false)     &&
          (m_TransferError    == SYS_READY) &&
          (TimeOut > 0))
    {
        TimeOut--;
    }

    // Wait until the Rx transfer is no longer active
    TimeOut = SD_DATA_TIMEOUT;
    while(((SDMMC1->STA & Flag) != 0) && (TimeOut > 0))
    {
        TimeOut--;
    }

    // Send stop command in multi block read
    if(m_Operation == SD_MULTIPLE_BLOCK)
    {
        State = this->TransmitCommand((CMD12 | SD_SHORT_RESPONSE), 0, 1);
    }

    if((TimeOut == 0) && (State == SYS_READY))
    {
        State = SYS_DATA_TIME_OUT;
    }

    // Return error state
    if(m_TransferError != SYS_READY)
    {
        return m_TransferError;
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: SelectTheCard
//
//   Parameter(s):  None
//   Return value:  SystemState_e
//
//   Description:   Select the card
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::SelectTheCard(void)
{
    SystemState_e State;

    State = TransmitCommand((CMD7 | SD_SHORT_RESPONSE), m_RCA, 1);      // Select the Card
    ClearClockRegister();

    return State;
}


/*
//-------------------------------------------------------------------------------------------------
//
//   Function name: WaitReady
//
//   Parameter(s):  uint32_t        Timer            Timeout in unit of 1 msec
//   Return value:  SystemState_e
//
//   Description:   Wait card ready
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::WaitReady(uint32_t Timer)
{
    uint32_t Response;

    m_TimeOut = Timer;

    do
    {
        this->TransmitCommand(CMD13, m_RCA, 1);
        SDMMC1->RESP1);

        if((Response & 0x00001E00) == 0x00000800)
        {
            return SYS_READY;
        }

        if(this->IsDetected() == SYS_DEVICE_NOT_PRESENT)                   // if card is Remove while waiting
        {
            return SYS_DEVICE_NOT_PRESENT;
        }
    }
    while(m_TimeOut != 0);

    return SYS_TIME_OUT;
}
*/

//-------------------------------------------------------------------------------------------------
//
//   Function name: SD DMA transfer complete RX and TX callback.
//
//   Parameter(s):  pDMA_Stream
//   Return value:  None
//
//   Description:   DMA IRQ
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::DMA_Complete(DMA_Stream_TypeDef* pDMA_Stream)
{
    //m_DMA_XferComplete = true;              // DMA transfer is complete          m_TransferComplete is probably enough
    while(m_TransferComplete == false){}    // Wait until SD transfer is complete
    //Disable
    pDMA_Stream->CR &= ~DMA_SxCR_EN;        // Disable the stream
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: SDIO_IRQHandler
//
//   Parameter(s):  None
//   Return value:  None
//
//   Description:   SDIO IRQ
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::SDMMC1_IRQHandler(void)
{
    // Check for SDMMC interrupt flags
    if((SDMMC1->STA & SDMMC_STA_DATAEND) != 0)
    {
        m_TransferError    = SYS_READY;
        m_TransferComplete = true;
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)    m_TransferError = SYS_CRC_FAIL;
    else if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)    m_TransferError = SYS_DATA_TIME_OUT;
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)     m_TransferError = SYS_OVERRUN;
    else if((SDMMC1->STA & SDMMC_STA_TXUNDERR) != 0)    m_TransferError = SYS_UNDERRUN;

    ClearAllFlag();

    // Disable all SDMMC peripheral interrupt sources
    SDMMC1->MASK &= ~(SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE | SDMMC_MASK_DATAENDIE  |
                      SDMMC_MASK_TXFIFOHEIE | SDMMC_MASK_RXFIFOHFIE | SDMMC_MASK_TXUNDERRIE |
                      SDMMC_MASK_RXOVERRIE);
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: RX_IRQHandler
//
//   Parameter(s):  None
//   Return value:  None
//
//   Description:   DMA IRQ
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::RX_IRQHandler(void)
{
    // Transfer Error Interrupt management
    if((DMA2->LISR & DMA_LISR_TEIF3) != 0)
    {
        if((DMA2_Stream3->CR & DMA_SxCR_TEIE) != 0)
        {
            DMA2_Stream3->CR   &= ~DMA_SxCR_TEIE;       // Disable the transfer error interrupt
            DMA2->LIFCR = DMA_LIFCR_CTEIF3;             // Clear the transfer error flag
        }
    }

    // FIFO Error Interrupt management
    if((DMA2->LISR & DMA_LISR_FEIF3) != 0)
    {
        if((DMA2_Stream3->FCR & DMA_SxFCR_FEIE) != 0)
        {
            DMA2_Stream3->FCR   &= ~DMA_SxFCR_FEIE;     // Disable the FIFO Error interrupt
            DMA2->LIFCR = DMA_LIFCR_CFEIF3;             // Clear the FIFO error flag
        }
    }

